// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   MkdirStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell mkdir command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_MKDIR_ZERO_LENGTH          #language eng  "%Hmkdir%N: Argument with zero length is not allowed\n"

#string STR_MKDIR_CANNOT_FIND          #language eng  "%Hmkdir%N: Cannot find %hs - %r\n"

#string STR_MKDIR_NO_DIR               #language eng  "%Hmkdir%N: No directory specified\n"

#string STR_MKDIR_DIR_EXISTS           #language eng  "%Hmkdir%N: Directory/File %hs already exists\n"

#string STR_MKDIR_CANNOT_CREATE        #language eng  "%Hmkdir%N: Cannot create %hs - %r\n"

#string STR_MKDIR_LINE_HELP            #language eng  "Creates one or more directories"

#string STR_MKDIR_VERBOSE_HELP         #language eng  "Creates one or more directories.\n"
                                                      "\n"
                                                      "MKDIR dir [dir...]\n"
                                                      "\n"
                                                      "    dir     - Name of a directory to be created(wildcards are not allowed)\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. The parent directory must already exist.\n"
                                                      "    2. If the directory already exists, it will fail to make such a directory.\n"
                                                      "    3. The directories in the command line should not rely on the creation of\n"
                                                      "       other directories in the command line. For example, mkdir new new\\test,\n"
                                                      "       is not allowed.\n"
                                                      "    4. Redirecting output to a file that exists under the directory specified\n"
                                                      "       on the command line is not allowed.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To create a new directory:\n"
                                                      "    fs0:\\> mkdir rafter\n"
                                                      "\n"
                                                      "    fs0:\\> ls\n"
                                                      "    Directory of: fs0:\\ \n"
                                                      "\n"    
                                                      "      06/18/01  08:05p <DIR>            512  test\n"
                                                      "      06/18/01  11:14p       r           29  readme.txt\n"
                                                      "      06/18/01  11:50p <DIR>            512  rafter\n"
                                                      "              1 File(s)         211 bytes\n"
                                                      "              2 Dir(s)\n"
                                                      "\n"
                                                      "  * To create multiple directories:\n"
                                                      "    fs0:\\> mkdir temp1 temp2\n"
                                                      "    fs0:\\> ls\n"
                                                      "    Directory of: fs0:\\ \n"
                                                      "\n"    
                                                      "      06/18/01  08:05p <DIR>            512  test\n"
                                                      "      06/18/01  11:14p       r           29  readme.txt\n"
                                                      "      06/18/01  11:50p <DIR>            512  rafter\n"
                                                      "      06/18/01  11:52p <DIR>            512  temp1\n"
                                                      "      06/18/01  11:52p <DIR>            512  temp2\n"
                                                      "              1 File(s)         211 bytes\n"
                                                      "              4 Dir(s)\n"


